#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_PROD.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/270966e6-985c-4d55-a35c-53e32ab4cf46]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_PROD.module.moh_applications.module.GENESYS.keycloak_saml_client.CLIENT has changed
  ~ resource "keycloak_saml_client" "CLIENT" {
      + extra_config                        = {}
        id                                  = "691f67c0-a808-49bf-8517-0fa0e14a4354"
        name                                = "GENESYS"
        # (24 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.PANORAMA.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PANORAMA"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "An eHealth system that allows authorized public health care providers to document and securely store all public health services and care programs in BC and Yukon."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "Panorama"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://pan-reports-prd.bchealthcloud.ca/*",
          + "https://pan-reports-ps1.bchealthcloud.ca/*",
          + "https://pan-reports-ps2.bchealthcloud.ca/*",
          + "https://pan-reports-ps3.bchealthcloud.ca/*",
          + "https://pan-reports-stg.bchealthcloud.ca/*",
          + "https://phis.phsa.ca/*",
          + "https://phix-ps1.stg.phis.phsa.ca/*",
          + "https://phix-ps2.stg.phis.phsa.ca/*",
          + "https://phix-ps3.stg.phis.phsa.ca/*",
          + "https://phix-stg.stg.phis.phsa.ca/*",
          + "https://phix.phis.phsa.ca/*",
          + "https://ps1.stg.phis.phsa.ca/*",
          + "https://ps2.stg.phis.phsa.ca/*",
          + "https://ps3.stg.phis.phsa.ca/*",
          + "https://scheduler-ps1.stg.phis.phsa.ca/*",
          + "https://scheduler-ps2.stg.phis.phsa.ca/*",
          + "https://scheduler-ps3.stg.phis.phsa.ca/*",
          + "https://scheduler-stg.stg.phis.phsa.ca/*",
          + "https://scheduler.phis.phsa.ca/*",
          + "https://stg.phis.phsa.ca/*",
          + "https://www.phis.phsa.ca/*",
          + "https://www.stg.phis.phsa.ca/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PANORAMA.keycloak_openid_user_session_note_protocol_mapper.identity_provider will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "identity_provider" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "identity_provider"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "identity_provider"
      + realm_id            = "moh_applications"
      + session_note        = "identity_provider"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*